IDEA Open Model
RebarHookBase Properties
Compatible with IDEA StatiCa 20.1
The RebarHookBase type exposes the following members.
Properties
Name | Description
AxisY
 Gets or sets the position (direction) of the hook in 3D. It representa a Local Coordinate System. Hook lie in X-Y Plane. AxisX is defined by first/last segment of the rebar. AxisX and AxisY creates a plane where the hook lies.
Reverse
 Reverse direction of the hook
Top
See Also
Reference
RebarHookBase Class
IdeaRS.OpenModel.Model Namespace